CREATE VIEW [cass].v_dim_Пользователи_на_кассах
AS
SELECT        cass.t_dim_Пользователи_на_кассах.Код_кассы, cass.t_dim_Пользователи_на_кассах.Логин_пользователя, 
                         cass.t_dim_Пользователи_на_кассах.Имя_пользователя, cass.t_dim_Пользователи_на_кассах.Запрещена_авторизация, cass.t_dim_Пользователи_на_кассах.Должность, cass.t_dim_Пользователи_на_кассах.ИНН, 
                         cass.v_dim_Кассы.Код_магазина, cass.v_dim_Кассы.Группа_магазина, cass.v_dim_Кассы.Наименование_магазина, cass.t_dim_Пользователи_на_кассах.Составной_код_кассира
FROM            cass.t_dim_Пользователи_на_кассах INNER JOIN
                         cass.v_dim_Кассы ON cass.t_dim_Пользователи_на_кассах.Код_кассы = cass.v_dim_Кассы.Код_кассы

GO