CREATE VIEW [cass].[v_fact_Скидочные_карты_в_чеках]
	AS SELECT 
		[cass].[t_fact_Скидки].[Дата_применения_скидки],
		[cass].[t_fact_Чеки].[Составной_код_документа],
		[cass].[t_fact_Детализация_чеков].[Номер_позиции_в_чеке],
		[cass].[t_fact_Детализация_чеков].[Составной_код_позиции],
		CONCAT(trim(Номер_дисконтной_карты), '~', trim(Название_дисконтной_карты)) AS Составной_ид_карты
	FROM [cass].[t_fact_Скидки]
	join 
		[cass].[t_fact_Детализация_чеков] on [cass].[t_fact_Скидки].[Составной_код_позиции] = [cass].[t_fact_Детализация_чеков].[Составной_код_позиции]
	join
		[cass].[t_fact_Чеки] on [cass].[t_fact_Чеки].[Составной_код_документа] = [cass].[t_fact_Детализация_чеков].[Составной_код_документа]