CREATE VIEW cass.v_j_Итория_загрузки_смен
AS
SELECT        TOP (100) PERCENT cass.t_j_История_загрузки_смен_на_кассе.Код_события, cass.t_j_История_загрузки_смен_на_кассе.ИД_обмена, cass.t_j_История_загрузки_смен_на_кассе.Код_кассы, 
                         dbo.t_dim_Магазины.Наименование, cass.t_j_История_загрузки_смен_на_кассе.ИД_смены, cass.t_j_История_загрузки_смен_на_кассе.Дата_время_начала_загрузки, 
                         cass.t_j_История_загрузки_смен_на_кассе.Дата_время_окончания_загрузки, DATEDIFF(ms, cass.t_j_История_загрузки_смен_на_кассе.Дата_время_начала_загрузки, 
                         cass.t_j_История_загрузки_смен_на_кассе.Дата_время_окончания_загрузки) AS [Время загрузки в мс], cass.t_fact_Смены_на_кассах.Составной_код_кассира, cass.t_fact_Смены_на_кассах.Дата_время_начала_смены, 
                         cass.t_fact_Смены_на_кассах.Дата_время_окончания_смены, cass.t_fact_Смены_на_кассах.Номер_первого_чека_в_смене, cass.t_fact_Смены_на_кассах.Номер_последнего_чека_в_смене, 
                         cass.t_fact_Смены_на_кассах.Сумма_продажи, cass.t_fact_Смены_на_кассах.Сумма_выручки, cass.t_fact_Смены_на_кассах.Сумма_в_денежном_ящике, cass.t_fact_Смены_на_кассах.Сумма_возвратов, 
                         cass.t_fact_Смены_на_кассах.Количество_чеков_продажи, cass.t_fact_Смены_на_кассах.Количество_чеков_возврата
FROM            cass.t_j_История_загрузки_смен_на_кассе with (nolock) INNER JOIN
                         cass.t_dim_Кассы with (nolock) ON cass.t_j_История_загрузки_смен_на_кассе.Код_кассы = cass.t_dim_Кассы.Код_кассы INNER JOIN
                         dbo.t_dim_Магазины with (nolock) ON cass.t_dim_Кассы.Код_магазина = dbo.t_dim_Магазины.Код LEFT OUTER JOIN
                         cass.t_fact_Смены_на_кассах WITH (nolock) ON  
                         cass.t_j_История_загрузки_смен_на_кассе.Составной_код_смены = cass.t_fact_Смены_на_кассах.Составной_код_смены
ORDER BY cass.t_j_История_загрузки_смен_на_кассе.Код_события DESC

GO
