-- =============================================
-- Author:		kma1860
-- Create date: 23/09/2022
-- Description:	Получает последние 1000 записей по кассе с ошибками
-- =============================================
CREATE PROCEDURE [cass].[p_История_загрузки_смен]
AS BEGIN
    SELECT TOP (1000) [Код_события]
          ,[ИД_обмена]
          ,[Код_кассы]
          ,[Наименование]
          ,[ИД_смены]
          ,[Дата_время_начала_загрузки]
          ,[Дата_время_окончания_загрузки]
          ,[Время загрузки в мс]
          ,[Составной_код_кассира]
          ,[Дата_время_начала_смены]
          ,[Дата_время_окончания_смены]
          ,[Номер_первого_чека_в_смене]
          ,[Номер_последнего_чека_в_смене]
          ,[Сумма_продажи]
          ,[Сумма_выручки]
          ,[Сумма_в_денежном_ящике]
          ,[Сумма_возвратов]
          ,[Количество_чеков_продажи]
          ,[Количество_чеков_возврата]
    FROM [DWH].[cass].[v_j_Итория_загрузки_смен]
    ORDER BY Код_события DESC
END