-- =============================================
-- Author:		kma1860
-- Create date: 27/09/2022
-- Description:	Загрузка данных о товародвижении из CS
-- =============================================
CREATE PROCEDURE [td].[p_Загрузка_товародвижения]
@Количество_дней int = 60
AS
BEGIN
	set noCount on;

	-- Переменные для ведения журнала
	declare @object_name  nvarchar(128);                              -- Наименование данной хранимки для заиписи в журнал
	declare @msg          nvarchar(max);                              -- Переменная для хранения текста, которое будет записано в журнал
	set @object_name = object_schema_name(@@procid)+'.'+object_name(@@procid); -- Получаем название данной процедуры

	declare @Флаг_получения_данных_с_удаленного_сервера bit;

	-- 1. АКТЫ СПИСАНИЯ

	drop table if exists [td].t_raw_Товародвижение_АС;
	create table [td].t_raw_Товародвижение_АС (
		Склад               nvarchar(100),
		Код_причины         tinyint,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW

	declare @dateStart date, @dateEnd date, @Query nvarchar(max);
	set @dateEnd   = cast(getDate() as date);
	set @dateStart = dateAdd(day, -@Количество_дней, @dateEnd);
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад],[КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад],[КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_АктСписания]
				WHERE
					Состояние = 1 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_АС exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить акты списания на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_АС) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 1

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[АС]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 1, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_АС
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить акты списания. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 2. ИНВЕНТАРИЗАЦИИ

	drop table if exists [td].t_raw_Товародвижение_ИНВ;
	create table [td].t_raw_Товародвижение_ИНВ (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW

	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], [Причина] as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [Р_СуммаЗакупа] as [СуммаЗакупа], [СР] as [Сумма], 
					[Р_СуммаЗакупаСоСклада] / [Разница] as [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Разница] as [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Инвентаризация]
				WHERE
					Состояние = 1 and [Разница] <> 0 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_ИНВ exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Инвентаризации на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try

		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_ИНВ) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 2

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[ИНВ]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 2, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_ИНВ
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Инвентаризации. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 3. ПРИХОДНЫЕ ДОКУМЕНТЫ
	drop table if exists [td].t_raw_Товародвижение_ПД;
	create table [td].t_raw_Товародвижение_ПД (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], NULL as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], 
					[ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [ЕД], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_ПД]
				WHERE
					Состояние = 1 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';

	
		insert into [td].t_raw_Товародвижение_ПД exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Приходные документы на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_ИНВ) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 3

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[ПД]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_ПД
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Приходные документы. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 4. ВОЗВРАТ ПОКУПАТЕЛЯ
	drop table if exists [td].t_raw_Товародвижение_В;
	create table [td].t_raw_Товародвижение_В (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], [_код_Причина] as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], 
					[Р_СуммаЗакупаСоСклада] / [Ед] as [ЦенаЗакупаСоСклада], [СуммаЗакупа] / [Ед] as [ЦенаЗакупа], [Цена], [ЕД], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_ВозвратПокупателя]
				WHERE
					Состояние = 1 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_В exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Возвраты покупателя на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_В) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 4

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[В]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 4, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_В
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Возвраты. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 5. Возврат поставщику
	drop table if exists [td].t_raw_Товародвижение_ВП;
	create table [td].t_raw_Товародвижение_ВП (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW

	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], [_код_Причина] as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], 
					[Р_СуммаЗакупаСоСклада] / [Ед] as [ЦенаЗакупаСоСклада], [СуммаЗакупа] / [Ед] as [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Возврат_поставщику]
				WHERE
					Состояние = 1 and [Ед] <> 0 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_ВП exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Возвраты поставщику на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_ВП) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 5

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[ВП]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_ВП
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Возвраты поставщикам. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 6. Выпуск продукции
	drop table if exists [td].t_raw_Товародвижение_ВыП;
	create table [td].t_raw_Товародвижение_ВыП (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], NULL as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], 
					[Р_СуммаЗакупаСоСклада] / [Количество] as [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Количество] as [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Выпуск_продукции]
				WHERE
					Состояние = 1 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_ВыП exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Выпуск продукции на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_ВыП) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 6

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[ВП]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_ВыП
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Выпуск продукции. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 7. Отчёт отдела
	drop table if exists [td].t_raw_Товародвижение_ОО;
	create table [td].t_raw_Товародвижение_ОО (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], NULL as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [Р_СуммаЗакупа] as [СуммаЗакупа], [Сумма], 
					[Р_СуммаЗакупаСоСклада] / [Колво] as [ЦенаЗакупаСоСклада], [Р_СуммаЗакупа] / [Колво] as [ЦенаЗакупа], [Цена], [Колво] as [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Отчет_отдела]
				WHERE
					Состояние = 1 and [Колво] <> 0 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_ОО exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Отчеты отдела на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_ОО) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 7

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[ОО]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_ОО
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Отчеты отдела. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 8. Расходные документы
	drop table if exists [td].t_raw_Товародвижение_РД;
	create table [td].t_raw_Товародвижение_РД (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], NULL as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], 
					[Р_СуммаЗакупаСоСклада] / [Ед] as [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Расходные_документы]
				WHERE
					Состояние = 1 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_РД exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Расходные документы на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_РД) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 8

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[РД]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_РД
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Расходные документы. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 9. Перемещения
	drop table if exists [td].t_raw_Товародвижение_Пер_Исх;
	create table [td].t_raw_Товародвижение_Пер_Исх (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW

	drop table if exists [td].t_raw_Товародвижение_Пер_Вх;
	create table [td].t_raw_Товародвижение_Пер_Вх (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], NULL as [КодПричины], [Р_СуммаЗакупаСоСклада] *-1 as [СуммаЗакупаСоСклада], [СуммаЗакупа] *-1 as [СуммаЗакупа], [Сумма] *-1 as [Сумма], 
					[Р_СуммаЗакупаСоСклада] / [Ед] *-1 as [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед]*-1 as [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Перемещения]
				WHERE
					Состояние = 1 and [Ед] <> 0 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';	
		insert into [td].t_raw_Товародвижение_Пер_Исх exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[СкладПолучатель] as [Склад], NULL as [КодПричины], [Р_СуммаЗакупаСоСклада] as [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма] , 
					[Р_СуммаЗакупаСоСклада] / [Ед] as [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Перемещения]
				WHERE
					Состояние = 1 and [Ед] <> 0 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_Пер_Вх exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Перемещения на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_Пер_Исх) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_Пер_Вх) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 9

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[Пер]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_Пер_Исх

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[Пер]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_Пер_Вх
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Перемещения. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

	-- 10. Акты о переоценке
	drop table if exists [td].t_raw_Товародвижение_АОП;
	create table [td].t_raw_Товародвижение_АОП (
		Склад               nvarchar(100),
		Код_причины         int,
		Сумма               decimal(14, 2),
		СуммаЗакупа         decimal(14, 2),
		СуммаЗакупаСоСклада decimal(14, 2),
		Цена                decimal(14, 2),
		ЦенаЗакупа          decimal(14, 2),
		ЦенаЗакупаСоСклада  decimal(14, 2),
		Количество          decimal(14, 3),
		КодТовара           bigint,
		Дата                date,
		Код_магазина        int,
		Номер               int
	) ON RAW
	begin try
		set @Флаг_получения_данных_с_удаленного_сервера = 0;
		set @Query = '
			SELECT 
				[Склад], [КодПричины], [СуммаЗакупаСоСклада], [СуммаЗакупа], [Сумма], [ЦенаЗакупаСоСклада], [ЦенаЗакупа], [Цена], [Ед], [КодТовара], [Дата], [Код_Магазина], [Номер]
			FROM OPENQUERY ([S19-STORAGE-SQL], ''
				SELECT
					[Склад], [_код_Причина] as [КодПричины], 0 as [СуммаЗакупаСоСклада], 0 [СуммаЗакупа], [Сумма], 
					case when [Ед] <> 0 then [Р_СуммаЗакупаСоСклада] / [Ед] else 0 end as [ЦенаЗакупаСоСклада], case when [Ед] <> 0 then [Р_СуммаЗакупа] / [Ед] else 0 end [ЦенаЗакупа], [НоваяЦена] as [Цена], 0 as [Ед], [КодТовара], [Дата], [КодМагазина] as [Код_магазина], [Номер]
				FROM
					[CS].[dbo].[Факт_Акт_о_переоценке]
				WHERE
					Состояние = 1 and ДАТА BETWEEN ''''' + format(@dateStart, 'yyyyMMdd') + ''''' and ''''' + format(@dateEnd, 'yyyyMMdd') + ''''''')
		';
		insert into [td].t_raw_Товародвижение_АОП exec(@Query); -- Получаем локальную копию сырых данных на наш сервер
		set @Флаг_получения_данных_с_удаленного_сервера = 1;
	end try
	begin catch
		set @msg = concat('[Товародвижение] Не удалось загрузить Акты переоценки на удаленном сервере. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch
	if (@Флаг_получения_данных_с_удаленного_сервера = 1)
	begin try
		begin tran td_load_AS
		merge 
			[td].t_dim_Склад_в_магазине a
		using
			(select distinct Склад from [td].t_raw_Товародвижение_АОП) [raw] on a.Наименование_склада = [raw].Склад
		when not matched then 
			insert (Наименование_склада) values ([raw].Склад);

		delete from [td].t_fact_Товародвижение where Дата between @dateStart and @dateEnd and ВидДвижения = 10

		insert into [td].t_fact_Товародвижение (
			[Составной_код_документа], [Дата], [Код_магазина], [Склад_в_магазине], [ВидДвижения], [Код_товара], [Сумма], [СуммаЗакупа], [СуммаЗакупаСоСклада], 
			[Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		) select
			cast([Код_магазина] as nvarchar) + '[АОП]' + cast([Номер] as nvarchar),
			[Дата], [Код_магазина], (select Код_склада from [td].t_dim_Склад_в_магазине where Наименование_склада = [Склад]), 3, [КодТовара], [Сумма], [СуммаЗакупа], 
			[СуммаЗакупаСоСклада], [Цена], [ЦенаЗакупа], [ЦенаЗакупаСоСклада], [Количество], [Код_причины]
		from
			[td].t_raw_Товародвижение_АОП
		commit tran td_load_AS
	end try
	begin catch
		rollback tran td_load_AS
		set @msg = concat('[Товародвижение] Не удалось загрузить Акты о переоценке. Ошибка: ', error_message());
		exec [dbo].[p_Сообщить_в_общий_журнал] 1, @object_name, @msg;
	end catch

END