-- =============================================
-- Author:		kma1860
-- Create date: 07/10/2022
-- Description:	Загрузка справочника виды наценки из ОТБРС
-- =============================================
CREATE PROCEDURE [td].[p_Загрузка_спраочника_виды_наценки]
AS
BEGIN
	drop table if exists #виды_наценки_temp
	create table #виды_наценки_temp (
		[Код_причины] smallint not null,
		[Наименование_причины] nvarchar(50) not null,
		[Код_категории] smallint not null,
		[Наименование_категории] nvarchar(50) not null,
		[Код_в_бухгалтерской_базе] int null,
		[Заголовок] nvarchar(10) null,
		[Вид] tinyint null,
		[Сумма] decimal(10,2) null,
		[Процент] decimal(10,2) null,
		[Причина_по_умолчанию_для_отчетов] bit null,
		[Причина_для_учета_потерь] bit null,
		[Причина_для_учета_потерь_магазина] bit null
	)

	insert 
		into #виды_наценки_temp 
	select
		[Код_причины],
		[Наименование_причины],
		[Код_категории],
		[Наименование_категории],
		[Код_в_бухгалтерской_базе],
		[Заголовок],
		[Вид],
		[Сумма],
		[Процент],
		[Причина_по_умолчанию_для_отчетов],
		[Причина_для_учета_потерь],
		[Причина_для_учета_потерь_магазина]
	from openquery([otbrs_reader], '
		select
			cast(ВидыНаценки.code as smallint) as Код_причины,
			ВидыНаценки.descr as Наименование_причины,
			cast(ВидыНаценки2.code as smallint) as Код_категории,
			ВидыНаценки2.descr as Наименование_категории,
			cast(ВидыНаценки.SP1702 as int) as Код_в_бухгалтерской_базе,
			ВидыНаценки.SP1703 as Заголовок,
			cast(ВидыНаценки.SP1951 as tinyint) as Вид,
			ВидыНаценки.SP1952 as Сумма,
			ВидыНаценки.SP1953 as Процент,
			cast(ВидыНаценки.SP5707 as tinyint) as Причина_по_умолчанию_для_отчетов,
			cast(ВидыНаценки.SP5760 as bit) as Причина_для_учета_потерь,
			cast(ВидыНаценки.SP6044 as bit) as Причина_для_учета_потерь_магазина
		from
			SC1705 ВидыНаценки (nolock)
		left join
			SC1705 ВидыНаценки2 (nolock) on ВидыНаценки.parentId = ВидыНаценки2.id
		where
			ВидыНаценки.isFolder = 2	
	');
	merge 
		[td].[t_dim_Причины] a
	using
		(select * from #виды_наценки_temp) b
	on
		a.Код_причины = b.Код_причины
	when not matched then 
		insert (
			[Код_причины],
			[Наименование_причины],
			[Код_категории],
			[Наименование_категории],
			[Код_в_бухгалтерской_базе],
			[Заголовок],
			[Вид],
			[Сумма],
			[Процент],
			[Причина_по_умолчанию_для_отчетов],
			[Причина_для_учета_потерь],
			[Причина_для_учета_потерь_магазина]
		) values (
			b.[Код_причины],
			b.[Наименование_причины],
			b.[Код_категории],
			b.[Наименование_категории],
			b.[Код_в_бухгалтерской_базе],
			b.[Заголовок],
			b.[Вид],
			b.[Сумма],
			b.[Процент],
			b.[Причина_по_умолчанию_для_отчетов],
			b.[Причина_для_учета_потерь],
			b.[Причина_для_учета_потерь_магазина]
		)
	when matched then
		update set 
			a.[Код_причины] = b.[Код_причины],
			a.[Наименование_причины] = b.[Наименование_причины],
			a.[Код_категории] = b.[Код_категории],
			a.[Наименование_категории] = b.[Наименование_категории],
			a.[Код_в_бухгалтерской_базе] = b.[Код_в_бухгалтерской_базе],
			a.[Заголовок] = b.[Заголовок],
			a.[Вид] = b.[Вид],
			a.[Сумма] = b.[Сумма],
			a.[Процент] = b.[Процент],
			a.[Причина_по_умолчанию_для_отчетов] = b.[Причина_по_умолчанию_для_отчетов],
			a.[Причина_для_учета_потерь] = b.[Причина_для_учета_потерь],
			a.[Причина_для_учета_потерь_магазина] = b.[Причина_для_учета_потерь_магазина]
		;
END